---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LineColor
source: html/56392a00-8fc5-00df-a240-a9ceabba42e0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LineColor Property

"Color"

## Syntax (C#)
```csharp
public static ForgeTypeId LineColor { get; }
```